<?php
declare(strict_types=1);

function useGeminiEn($expression) {
    $req = "[$expression] Переклади українською. Якщо варіантів більше одного — запропонуй список. Якщо прямий переклад неоднозначний, наведи коментарі, може [інші] приклади, де вживаються подібні конструкції. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Якщо мова не англійська — вкажи її. Якщо це щось що не (обов'язково) перекладається, поясни, опиши.)";
    $req = "[$expression] Переклади українською. Якщо прямий переклад неоднозначний, наведи коментарі, може [інші] приклади, де вживаються подібні конструкції. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Якщо мова не англійська — вкажи її. Якщо це щось що не (обов'язково) перекладається, поясни, опиши.)";
    $req = "[$expression] Переклади українською. Якщо нема простого однозначного перекладу, наведи коментарі, може [інші] приклади, де вживаються подібні конструкції. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Якщо мова не англійська — вкажи її. Якщо це щось що не (обов'язково) перекладається, поясни, опиши.)";
    $req = "[$expression] Переклади/прокоментуй/поясни українською. Лаконічно, по суті. (Якщо є якась помилка — запропонуй правильний варіант, з перекладом. Якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "[$expression] Переклади/прокоментуй/поясни українською. (Якщо є якась помилка — запропонуй правильний варіант, з перекладом. Якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "[$expression] Переклади українською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. [Тільки!] якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади українською: $expression. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. [Тільки!] якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади з англійської українською або з української англійською: $expression. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. [Тільки!] якщо мова — якась третя — вкажи її та переклади українською.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Визнач мову: $expression. Якщо англійська — просто переклади українською; якщо українська — просто переклади англійською; якщо якась третя — вкажи її та переклади українською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Визнач мову: $expression. Якщо англійська — просто переклади українською; якщо українська — просто переклади англійською; якщо якась третя — вкажи її та переклади українською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українька — переклади англійською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українька — переклади англійською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант.) Результат подати як HTML div.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українcька — переклади англійською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант.) Результат подати як HTML article.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українcька — переклади англійською. Якщо є якась помилка — вкажи на неї, запропонуй правильний варіант. Якщо переклад неоднозначний — поясни, прокоментуй. Результат подати як HTML article.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українcька — переклади англійською. Якщо є якась помилка — вкажи на неї, запропонуй правильний варіант. Результат подати як HTML article.";

    $text = useGemini($req);
    if (preg_match('/<article.*?>(.*?)<\/article>/is', $text, $result)) {
        echo $result[1];
    } else {
        echo $text;
    }
}