<?php

function useGeminiEn($expression) {
    $key = Keys::$gemini;
    $url = "https://generativelanguage.googleapis.com/v1beta/models/gemini-2.0-flash:generateContent?key=$key";

    $req = "даний вираз: [$expression] очікувано англомовний. Переклади українською. Якщо варіантів більше одного — запропонуй список. Якщо це слово/вираз/ідіома, а не просто фрагмент тексту, може запропонуй приклад його використання. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Може це не англійська, запропонуй мову з перекладом, або щось, що не перекладається — опиши що це.)";
    $req = "[$expression] Переклади українською. Якщо варіантів більше одного — запропонуй список. Якщо прямий переклад неоднозначний, наведи коментарі, може [інші] приклади, де вживаються подібні конструкції. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Якщо мова не англійська — вкажи її. Якщо це щось що не (обов'язково) перекладається, поясни, опиши.)";
    $req = "[$expression] Переклади українською. Якщо прямий переклад неоднозначний, наведи коментарі, може [інші] приклади, де вживаються подібні конструкції. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Якщо мова не англійська — вкажи її. Якщо це щось що не (обов'язково) перекладається, поясни, опиши.)";
    $req = "[$expression] Переклади українською. Якщо нема простого однозначного перекладу, наведи коментарі, може [інші] приклади, де вживаються подібні конструкції. Якщо там якась помилка — запропонуй правильний варіант, з перекладом. (Якщо мова не англійська — вкажи її. Якщо це щось що не (обов'язково) перекладається, поясни, опиши.)";
    $req = "[$expression] Переклади/прокоментуй/поясни українською. Лаконічно, по суті. (Якщо є якась помилка — запропонуй правильний варіант, з перекладом. Якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "[$expression] Переклади/прокоментуй/поясни українською. (Якщо є якась помилка — запропонуй правильний варіант, з перекладом. Якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "[$expression] Переклади українською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. [Тільки!] якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади українською: $expression. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. [Тільки!] якщо мова не англійська — вкажи її.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади з англійської українською або з української англійською: $expression. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. [Тільки!] якщо мова — якась третя — вкажи її та переклади українською.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Визнач мову: $expression. Якщо англійська — просто переклади українською; якщо українська — просто переклади англійською; якщо якась третя — вкажи її та переклади українською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Визнач мову: $expression. Якщо англійська — просто переклади українською; якщо українська — просто переклади англійською; якщо якась третя — вкажи її та переклади українською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML article, з лаконічним форматуванням.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українька — переклади англійською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML article, з лаконічним форматуванням.";
    // $req = "Переклади (залежно від мови оригіналу) з англійської українською або з української англійською: $expression. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. Англійська/українська — мови за замовченнямм; тільки якщо мова — якась третя — вкажи її та переклади українською.) Результат подати як HTML article, з лаконічним форматуванням.";
    // $req = "Переклади (залежно від мови оригіналу) з англійської українською або з української англійською: $expression. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом. Якщо мова — якась третя — вкажи її та переклади українською.) Результат подати як HTML article, з лаконічним форматуванням.";
    // $req = "Переклади (залежно від мови оригіналу) з англійської українською або з української англійською: {$expression}. (Англійська/українська — мови за замовченням; тільки якщо мова — якась третя — вкажи її та переклади українською. Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант, з перекладом.) Результат подати як HTML div";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українька — переклади англійською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант.) Результат подати як HTML div.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українcька — переклади англійською. (Якщо переклад неоднозначний — поясни, прокоментуй. Якщо є якась помилка — запропонуй правильний варіант.) Результат подати як HTML article.";
    $req = "Переклади українською: $expression. Якщо мова слова/виразу/тексту — англійська — не згадуй це додатково; якщо не англійська — вкажи її; якщо українcька — переклади англійською Якщо є якась помилка — вкажи на неї, запропонуй правильний варіант. Якщо переклад неоднозначний — поясни, прокоментуй. Результат подати як HTML article.";



    $data = [
        'contents' => [
            [
                'parts' => [
                    ['text' => $req]
                ]
            ]
        ]
    ];

    $response = useCurl($url, 'post', null, $data);

    $array = json_decode($response, true);
    $text = $array['candidates'][0]['content']['parts'][0]['text'];
    // echo $text;
    if (preg_match('/<article.*?>(.*?)<\/article>/is', $text, $result)) {
        echo $result[1];
    } else {
        echo $text;
    }
}